# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'autojump'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'cowsay' # Some fun here and there
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20t
brew 'svn'
brew 'trash' # Manage the Trash bin, TODO: figure out how to use
brew 'tree' # List directories in a tree structure, TODO: figure out how to use
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'postman'
cask 'pulse-sms'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
